app/views/tracking_plans/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "tracking_plan_to_event_mappings" ON "events"."id" = "tracking_plan_to_event_mappings"."event_id" WHERE "tracking_plan_to_event_mappings"."tracking_plan_id" = ?  [["tracking_plan_id", 1]]
---
<div> <b>Events:</b>
<% @tracking_plan.events.each do |event| %>