app/controllers/api/v1/events_controller.rb

INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
      def create
        name = params[:name]
        description = params[:description]
        rules = params[:rules]
        if name.blank? || description.blank? || rules.blank?
          return response_data({}, 'Missing params', 422, error: {})
        end

        if name_exists(name)
          return response_data({}, 'Event with this name already exists', 422, error: {})
        end

        event = Event.create(name: name, description: description, rules: rules)

SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "Order Viewed"], ["LIMIT", 1]]
---
      def update
        id = params[:id]
        event = Event.find_by(id: id)
        return response_data({}, 'Event not found', 422, error: {}) if event.blank?
        if params[:name].present? && name_exists(params[:name])
          return response_data({}, 'Event with this name already exists', 422, error: {})
        end
        event.name = params[:name] if params[:name].present?
        event.description = params[:description] if params[:description].present?
        event.rules = params[:rules] if params[:rules].present?

SELECT "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "Order Viewed"], ["LIMIT", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "Order Viewed"], ["LIMIT", 1]]
---
      def name_exists(name)
        Event.where(name: name).exists?