app/controllers/api/v1/send_event_api_controller.rb

      def send_event
        if params[:name].blank? || params[:properties].blank?
          return response_data({}, 'Wrong parameters', 422)
        end

        event = Event.find_by(name: params[:name])
---
SELECT "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "Order Viewed"], ["LIMIT", 1]]