app/controllers/events_controller.rb

  def create
    @event = Event.new
    event_params =  params[:event]
    event = {name: event_params[:name], description: event_params[:description], rules: event_params[:rules].as_json }
    success, message, event_id = Event.create_event(event)
    respond_to do |format|
      if success
        @event = Event.find(event_id)
---
INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "12345"], ["description", "12345"], ["rules", "\"{'abcd': '1234'}\""], ["created_at", "2023-08-20 16:29:07.174979"], ["updated_at", "2023-08-20 16:29:07.174979"]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    event_params =  params[:event]
    update_params = {}
    update_params[:id] = params[:id]
    update_params[:name] = event_params[:name]  if event_params[:name] != @event.name
    update_params[:description] = event_params[:description]  if event_params[:description] != @event.description
    update_params[:rules] = event_params[:rules]  if event_params[:rules] != @event.rules
    success, message, event = Event.update_event(update_params)
---
UPDATE "events" SET "name" = ?, "rules" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "My event111"], ["rules", "\"{}\""], ["updated_at", "2023-08-21 06:38:44.541255"], ["id", 1]]