app/controllers/tracking_plans_controller.rb

SELECT "tracking_plans".* FROM "tracking_plans"
---
  def index
    @tracking_plans = TrackingPlan.all

INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "namsa"], ["description", " aemae"], ["rules", "\"aee\""], ["created_at", "2023-08-24 14:15:49.938212"], ["updated_at", "2023-08-24 14:15:49.938212"]]
INSERT INTO "tracking_plans" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "name"], ["description", nil], ["created_at", "2023-08-24 14:15:49.937299"], ["updated_at", "2023-08-24 14:15:49.937299"]]
---
  def create
    @tracking_plan = TrackingPlan.new(tracking_plan_params)
    tracking_plan = params["tracking_plan"]
    name = tracking_plan["name"]
    description = tracking_plan["description"]
    events  = tracking_plan["events_attributes"]&.values

    respond_to do |format|
      if params[:add_event]
        @tracking_plan.events.build
        format.html { render :new, status: :unprocessable_entity }
      else

        success, message, @tracking_plan = TrackingPlan.create_plan(
          {name: name, description: description, events: events})

SELECT "tracking_plans".* FROM "tracking_plans" WHERE "tracking_plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tracking_plan
    @tracking_plan = TrackingPlan.find(params[:id])

SELECT "events"."name", "events"."id" FROM "events" ORDER BY "events"."id" DESC
---
  def set_events
    @events = Event.all.order(id: :desc).pluck(:name, :id)