app/controllers/tracking_plans_controller.rb

SELECT "tracking_plans".* FROM "tracking_plans" WHERE "tracking_plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tracking_plan
    @tracking_plan = TrackingPlan.find(params[:id])

SELECT "events"."name", "events"."id" FROM "events" ORDER BY "events"."id" DESC
---
  def set_events
    @events = Event.all.order(id: :desc).pluck(:name, :id)