app/models/event.rb

  def self.create_event(params)
    name = params[:name]
    description = params[:description]
    rules = params[:rules]
    if name.blank? || description.blank? || rules.blank?
      return [false, 'Missing params', nil]
    end

    if self.name_exists(name)
      return [false, 'Event with this name already exists', nil]
    end

    event = Event.create(name: name, description: description, rules: rules)
---
INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def self.update_event(params)
    id = params[:id]
    event = Event.find_by(id: id)
    return [false, 'Event doesn;t exist', event] if event.blank?

    if params[:name].present? && name_exists(params[:name])
      return [false, 'Event with this name already exists', event]
    end
    event.name = params[:name] if params[:name].present?
    event.description = params[:description] if params[:description].present?
    event.rules = params[:rules] if params[:rules].present?
    event = event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "Order Viewed"], ["LIMIT", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "12345"], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "rules" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "My event111"], ["rules", "\"{}\""], ["updated_at", "2023-08-21 06:38:44.541255"], ["id", 1]]

  def self.name_exists(name)
    Event.where(name: name).exists?
---
SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "new event"], ["LIMIT", 1]]