app/models/tracking_plan.rb

INSERT INTO "tracking_plans" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "name"], ["description", nil], ["created_at", "2023-08-24 14:20:09.061357"], ["updated_at", "2023-08-24 14:20:09.061357"]]
INSERT INTO "tracking_plan_to_event_mappings" ("event_id", "tracking_plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 12], ["tracking_plan_id", 14], ["created_at", "2023-08-24 14:51:51.004870"], ["updated_at", "2023-08-24 14:51:51.004870"]]
INSERT INTO "tracking_plans" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Name new"], ["description", nil], ["created_at", "2023-08-24 14:51:35.693750"], ["updated_at", "2023-08-24 14:51:35.693750"]]
---
  def self.create_plan(params)
    name = params[:name]
    description = params[:description]
    rules = params[:rules]
    events = params[:events]

    return [false, 'Missing params', nil] if name.blank?

    event_ids = []
    if events.present?
      events = TrackingPlan.sanitize_events(events)
      rules=  {}
      rules[:events] = events
    end
    if rules.present?
      success, error_message, event_ids = TrackingPlan.validate_rules(rules)
      return [false, error_message, nil] if !success
    end
    tracking_plan = TrackingPlan.create(name: name, description: description)
    unless event_ids.blank?
      event_ids.each do |event_id|
        TrackingPlanToEventMapping.create(tracking_plan_id: tracking_plan.id, event_id: event_id)

SELECT "tracking_plans".* FROM "tracking_plans" WHERE "tracking_plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tracking_plan_to_event_mappings" ("event_id", "tracking_plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 19], ["tracking_plan_id", 1], ["created_at", "2023-08-24 19:03:39.814405"], ["updated_at", "2023-08-24 19:03:39.814405"]]
---
  def self.update_plan(params)
    id = params[:id]
    tracking_plan = TrackingPlan.find_by(id: id)
    return [false, 'Tracking Plan not found', nil] if tracking_plan.blank?
    events = params[:events]
    event_ids = []
    rules=  {}
    if events.present?
      events = TrackingPlan.sanitize_events(events)
      rules[:events] = events
    end
    if rules.present?
      success, error_message, event_ids = TrackingPlan.validate_rules(rules, true, tracking_plan.id)
      return [false, error_message, nil] if !success
    end
    tracking_plan.name = params[:name] if params[:name].present?
    tracking_plan.description = params[:description] if params[:description].present?
    tracking_plan = tracking_plan.save
    unless event_ids.blank?
      event_ids.each do |event_id|
        TrackingPlanToEventMapping.create(tracking_plan_id: id, event_id: event_id)

SELECT 1 AS one FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "new event"], ["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "new event"], ["description", "event new"], ["rules", "\"ewvewew\""], ["created_at", "2023-08-24 14:51:50.992182"], ["updated_at", "2023-08-24 14:51:50.992182"]]
SELECT 1 AS one FROM "events" WHERE "events"."name" IN (?, ?, ?, ?) LIMIT ?  [["name", "My event111"], ["name", "Order Viewed"], ["name", "My event111"], ["name", "Order Viewed"], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."name" = ? LIMIT ?  [["name", "My event111"], ["LIMIT", 1]]
DELETE FROM "tracking_plan_to_event_mappings" WHERE "tracking_plan_to_event_mappings"."id" = ?  [["id", 17]]
SELECT "tracking_plan_to_event_mappings".* FROM "tracking_plan_to_event_mappings" WHERE "tracking_plan_to_event_mappings"."event_id" = ? AND "tracking_plan_to_event_mappings"."tracking_plan_id" = ? ORDER BY "tracking_plan_to_event_mappings"."id" DESC LIMIT ?  [["event_id", 1], ["tracking_plan_id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My event111222"], ["description", "asdf"], ["rules", "\"{}\""], ["created_at", "2023-08-24 19:03:39.793572"], ["updated_at", "2023-08-24 19:03:39.793572"]]
INSERT INTO "events" ("name", "description", "rules", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My event1112"], ["description", "asdf"], ["rules", "\"{}\""], ["created_at", "2023-08-24 19:07:50.496462"], ["updated_at", "2023-08-24 19:07:50.496462"]]
---
  def self.validate_rules(rules, is_update=false, tracking_plan_id = nil)
    return [false, 'Event Parameters missing', nil] if rules.blank?
    event_ids = []
    unless rules[:events].blank?
      event_names = []
      events = rules[:events]
      events.each do |event|
        return [false, 'Event Parameters missing', event_ids] if event[:name].blank? || event[:rules].blank?
        event_names << event[:name]
      end
      if Event.where(name: event_names).exists?
        unless is_update
          return [false, 'Event name already exists', event_ids]
        end
      end

      events.each do |event|
        if is_update
          old_event = Event.find_by(name: event[:name])
          if old_event.present?
            if !event[:remove]
              next
            elsif is_update && event[:remove]
              event_id = Event.find_by(name: event[:name]).id
              TrackingPlanToEventMapping.where(event_id: event_id, tracking_plan_id: tracking_plan_id).last&.destroy
              next
            end
          end
        end
        event = Event.create(name: event[:name], description:  event[:description], rules:  event[:rules])
        event_ids << event.id